# EMATM0048: SDPA 
## Teaching Session 8B: Data analysis with Pandas
`Original - Zahraa Abdallah `
`Nov 2020. `
`Modified - Qiang Liu Nov 2023`

Pandas builds on top of Numpy to ease managing heterogeneous data sets. It aims to be the fundamental high-level building block for doing practical, real world data analysis in Python (http://pandas.pydata.org/)


This tutorial covers the following topics:

- Pandas data structures
- DataFrame Basic Functionality
- Indexing and slicing DataFrames
- Dropping data from a dataFrame
- Modifying dataFrames
- Handling missing data
- Grouping and aggregation of data
- Writing data frames to CSV files

## 1. Pandas Data Structures
Pandas is build around the following data structures

- `Series` represent 1 dimensional datasets as subclass of Numpy's ndarray
- `DataFrame` represent 2 dimensional data sets as list of Series
- `Panel` represents higher dimensional data as dictionaries of DataFrame's. We do not discuss Panel's here.

For all data structures, labels/indices can be defined per row and column.

## 1.1 Series: labelled arrays
Series is a one-dimensional labeled array capable of holding any data type (integers, strings, ﬂoating point numbers,Python objects, etc.). The axis labels are collectively referred to as the index. The basic method to create a Series is to call:

- Series(data, index=index)

data may be a dict, a numpy.ndarray or a sclar value

### Creating a series:
### 1- With a default index:

In [1]:
import numpy as np # we need numpy
import pandas as pd #import pandas


values = np.array([2.0, 1.0, 5.0, 0.97, 3.0, 10.0, 0.0599, 8.0]) #create numpy array
ser = pd.Series(values) # now create series
print (ser)

0     2.0000
1     1.0000
2     5.0000
3     0.9700
4     3.0000
5    10.0000
6     0.0599
7     8.0000
dtype: float64

### 2. With a customisied index:

In [2]:
#now lets put some index on the data
#indices will be great later on when accessing datas
#indices represent unique identifiers for rows
values = np.array([2.0, 1.0, 5.0, 0.97, 3.0, 10.0, 0.0599, 8.0])
labels = ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H']
ser = pd.Series(data=values, index=labels)#values and labels must have the same dimension
print(ser)

A     2.0000
B     1.0000
C     5.0000
D     0.9700
E     3.0000
F    10.0000
G     0.0599
H     8.0000
dtype: float64

### 3. Creating a heterogeneous series:

In [3]:
#craeting a heterogeneous series
movie_rating = {
    'age': 1,
    'gender': 'F',
    'genres': 'Drama',
    'movie_id': 1193,
    'occupation': 10,
    'rating': 5,
    'timestamp': 978300760,
    'title': "One Flew Over the Cuckoo's Nest (1975)",
    'user_id': 1,
    'zip': '48067'
    }
ser = pd.Series(movie_rating)
print(ser)

age                                                1
gender                                             F
genres                                         Drama
movie_id                                        1193
occupation                                        10
rating                                             5
timestamp                                  978300760
title         One Flew Over the Cuckoo's Nest (1975)
user_id                                            1
zip                                            48067
dtype: object

### Showing series index  and values

In [4]:
#show the index
ser.index

Index(['age', 'gender', 'genres', 'movie_id', 'occupation', 'rating',
       'timestamp', 'title', 'user_id', 'zip'],
      dtype='object')

In [5]:
#show the value
ser.values

array([1, 'F', 'Drama', 1193, 10, 5, 978300760,
       "One Flew Over the Cuckoo's Nest (1975)", 1, '48067'], dtype=object)

## 1.2. DataFrame: a Series of Series
Pandas DataFrame is a 2 dimensional labeled data structure with columns of potentially different types. Similar to

a spreadsheet
relational database table
a dictionary of series

## Creating DataFrame's

DataFrame's can be created from

dict of Series
dict of ndarrays
structured or record arrays
from a list of dicts
From a dict of tuples
From a Series

### Creating a DataFrame from a dictionary:

In [6]:
#dict of series
import pandas as pd
d = {'one' : pd.Series([1., 2., 3.], index=['a', 'b', 'c']),
    'two' : pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])}
df = pd.DataFrame(d)
print (df)

print ("Index:", df.index)
print ("Columns:", df.columns)

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0
Index: Index(['a', 'b', 'c', 'd'], dtype='object')
Columns: Index(['one', 'two'], dtype='object')

In [7]:
type(df['one'])

pandas.core.series.Series

In [8]:
#dict of lists
d = {'one' : [1., 2., 3., 4.],
    'two' :  [1., 2., 3., 4.]}
df= pd.DataFrame(d)
df

   one  two
0  1.0  1.0
1  2.0  2.0
2  3.0  3.0
3  4.0  4.0

In [9]:
df.loc[1:2]

   one  two
1  2.0  2.0
2  3.0  3.0

In [10]:
df.iloc[:, 'one']

ValueError: Location based indexing can only have [integer, integer slice (START point is INCLUDED, END point is EXCLUDED), listlike of integers, boolean array] types

### Creating a DataFrame from a list:

In [11]:
#form a list of dicts
data2 = [{'a': 1, 'b': 2}, {'a': 5, 'b': 10, 'c': 20}]
df= pd.DataFrame(data2)
df

   a   b     c
0  1   2   NaN
1  5  10  20.0

### Creating a DataFrame from a file: 
Pandas provides helper functions to read data from various file formats like CSV, Excel spreadsheets, HTML tables, JSON, SQL, and more. Data from the file is read and stored in a `DataFrame` object. We typically use the `_df` suffix in the variable names for dataframes.

In [12]:
df = pd.read_csv("iris.csv")
df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

--------------

# 2. DataFrame Basic Functionality
- Accessing head and tails via `DataFrame.head` and `DataFrame.tail`
-  Information of a DataFrame using `DataFrame.info` and `DataFrame.describe`
- Column values: `DataFrame.value_counts`, `DataFrame.unique` etc.

##  Head and Tail

In [13]:
df.head(10)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa
6           4.6          3.4           1.4          0.3  setosa
7           5.0          3.4           1.5          0.2  setosa
8           4.4          2.9           1.4          0.2  setosa
9           4.9          3.1           1.5          0.1  setosa

In [14]:
df.tail()

     sepal_length  sepal_width  petal_length  petal_width    species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

## Descriptive Statistics
Descriptive Statistics sumarizes the underlying distribution of data values through statistical values like mean, variance etc.

We can view some basic information about the data frame using the `.info` method.

In [15]:
df = pd.DataFrame(np.random.randn(10, 4), columns=['A', 'B', 'C', 'D']) 
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       10 non-null     float64
 1   B       10 non-null     float64
 2   C       10 non-null     float64
 3   D       10 non-null     float64
dtypes: float64(4)
memory usage: 448.0 bytes

It appears that each column contains values of a specific data type. You can view statistical information for numerical columns (mean, standard deviation, minimum/maximum values, and the number of non-empty values) using the `.describe` method.

In [16]:
df.describe()

               A          B          C          D
count  10.000000  10.000000  10.000000  10.000000
mean   -0.255636  -0.138590   0.217455  -0.002253
std     0.767953   0.927443   1.022467   0.899967
min    -1.618210  -1.595316  -1.240615  -1.605507
25%    -0.650732  -0.609569  -0.702210  -0.630369
50%    -0.248554  -0.145544   0.411662   0.137536
75%     0.370210   0.345192   0.917894   0.393659
max     0.722841   1.649405   1.982193   1.482297

In [17]:
df

          A         B         C         D
0 -0.494872 -0.698286 -1.240615  1.482297
1  0.722841 -0.343420  0.952122  0.288907
2  0.414623 -0.273488  0.815210 -0.656354
3 -0.257463  0.185487 -0.713901 -0.013836
4 -0.239645 -1.227382  0.984307 -0.619587
5 -1.618210  0.398427  0.433160  0.386491
6 -1.186111  1.649405 -0.667136  0.952978
7  0.236973  0.536277  1.982193 -0.633964
8 -0.702686 -0.017600 -0.760953 -1.605507
9  0.568194 -1.595316  0.390165  0.396048

In [18]:
#some examples
print (df.max())
print ("========================================")
print (df.max(axis=1))

A    0.722841
B    1.649405
C    1.982193
D    1.482297
dtype: float64
========================================
0    1.482297
1    0.952122
2    0.815210
3    0.185487
4    0.984307
5    0.433160
6    1.649405
7    1.982193
8   -0.017600
9    0.568194
dtype: float64

In [19]:
print (df.idxmax(axis=0))
print ("============================")
print (df.idxmin(axis=0))
print ("============================")
print (df.idxmax(axis=1))
print ("============================")
print (df.idxmin(axis=1))

A    1
B    6
C    7
D    0
dtype: int64
============================
A    5
B    9
C    0
D    8
dtype: int64
============================
0    D
1    C
2    C
3    B
4    C
5    C
6    B
7    C
8    B
9    A
dtype: object
============================
0    C
1    B
2    D
3    C
4    B
5    A
6    A
7    D
8    D
9    B
dtype: object

## Value counts and unique

`value_counts()`allows to count the histogram

In [20]:
d = {'one' : [1., 1., 2., 4.],
    'two' :  [1., 2., 3., 4.]}
df= pd.DataFrame(d)
df

   one  two
0  1.0  1.0
1  1.0  2.0
2  2.0  3.0
3  4.0  4.0

In [21]:
df['one'].value_counts()

one
1.0    2
2.0    1
4.0    1
Name: count, dtype: int64

In [22]:
df['one'].unique()

array([1., 2., 4.])

-----------------

# 3. Indexing and slicing DataFrames
The first thing you might want to do is retrieve data from this data frame. To do this, it might help to understand the internal representation of data in a data frame. Conceptually, you can think of a dataframe as a dictionary of lists: keys are column names, and values are lists/arrays containing data for the respective columns.

In [23]:
import numpy as np
data = np.random.randint(0, 10, size=(3,3))
frame = pd.DataFrame(data, index=['r1', 'r2', 'r3'], columns=['c1', 'c2', 'c3'])

In [24]:
frame

    c1  c2  c3
r1   4   4   5
r2   9   3   4
r3   9   5   0

In [25]:
del frame['c1']

In [26]:
frame

    c2  c3
r1   4   5
r2   3   4
r3   5   0

In [27]:
frame.drop('r1', axis=1)

KeyError: "['r1'] not found in axis"

## Retrieving columns:

With the dictionary of lists analogy in mind, you can now guess how to retrieve data from a data frame. For example, we can get a list of values from a specific column using the [] indexing notation.

In [28]:
import numpy as np
data = np.random.randint(0, 10, size=(3,3))
frame = pd.DataFrame(data, index=['r1', 'r2', 'r3'], columns=['c1', 'c2', 'c3'])
frame

    c1  c2  c3
r1   6   9   9
r2   3   1   8
r3   6   4   0

In [29]:
# retrieve one column
frame['c1']

r1    6
r2    3
r3    6
Name: c1, dtype: int64

instead of using the indexing notation [], Pandas also allows accessing columns as properties of the dataframe using the . notation. However, this method only works for columns whose names do not contain spaces or special characters.

In [30]:
frame.c1

r1    6
r2    3
r3    6
Name: c1, dtype: int64

Like arrays, you can retrieve a specific value with a series using the indexing notation `[]`.

In [31]:
frame['c1']['r2']

3

Further, you can also pass a list of columns within the indexing notation [] to access a subset of the data frame with just the given columns.

In [32]:
# retrieve multiple columns
slice_df= frame[['c1', 'c3']]
slice_df

    c1  c3
r1   6   9
r2   3   8
r3   6   0

The new data frame slice_df is simply a "view" of the original data frame . Both point to the same data in the computer's memory. Changing any values inside one of them will also change the respective values in the other. Sharing data between data frames makes data manipulation in Pandas blazing fast. You needn't worry about the overhead of copying thousands or millions of rows every time you want to create a new data frame by operating on an existing one.

Sometimes you might need a full copy of the data frame using `.copy()` method, in which case you can use the copy method.

## Retrieving rows: 
To access a specific row of data, Pandas provides the `.loc` method.

In [33]:
# retrive row by name
frame.loc['r1']

c1    6
c2    9
c3    9
Name: r1, dtype: int64

In [34]:
# retrive multiple rows by name
frame.loc[['r1','r3']]

    c1  c2  c3
r1   6   9   9
r3   6   4   0

In [35]:
#retrieve a single cell
frame['c1']['r1']

6

In [36]:
# Select across rows and columns by label
frame.loc[['r1', 'r2'], ['c1', 'c2']]

    c1  c2
r1   6   9
r2   3   1

In [37]:
frame.loc['r1':'r3', 'c1':'c3']

    c1  c2  c3
r1   6   9   9
r2   3   1   8
r3   6   4   0

In [38]:
frame.iloc[:2, :2]

    c1  c2
r1   6   9
r2   3   1

## Masking: Boolean indexing

In [39]:
frame

    c1  c2  c3
r1   6   9   9
r2   3   1   8
r3   6   4   0

In [40]:
frame[frame['c1']>0]

    c1  c2  c3
r1   6   9   9
r2   3   1   8
r3   6   4   0

In [41]:
frame < 5

       c1     c2     c3
r1  False  False  False
r2   True   True  False
r3  False   True   True

In [42]:
frame[frame<5] = -1
frame

    c1  c2  c3
r1   6   9   9
r2  -1  -1   8
r3   6  -1  -1

**RECOMMENDED:** Always use loc and iloc to reduce ambiguity, specially with DataFrames with numeric indexes.

----------

## Example:

In [43]:
df = pd.DataFrame({
    'Population': [35.467, 63.951, 80.94 , 60.665, 127.061, 64.511, 318.523],
    'GDP': [
        1785387,
        2833687,
        3874437,
        2167744,
        4602367,
        2950039,
        17348075
    ],
    'Surface Area': [
        9984670,
        640679,
        357114,
        301336,
        377930,
        242495,
        9525067
    ],
    'HDI': [
        0.913,
        0.888,
        0.916,
        0.873,
        0.891,
        0.907,
        0.915
    ], # Human Development Index
    'Continent': [
        'America',
        'Europe',
        'Europe',
        'Europe',
        'Asia',
        'Europe',
        'America'
    ]
}, columns=['Population', 'GDP', 'Surface Area', 'HDI', 'Continent'])

DataFrames also have indexes. As you can see in the "table" above, pandas has assigned a numeric, autoincremental index automatically to each "row" in our DataFrame. In our case, we know that each row represents a country, so we'll just reassign the index:

In [44]:
df

   Population       GDP  Surface Area    HDI Continent
0      35.467   1785387       9984670  0.913   America
1      63.951   2833687        640679  0.888    Europe
2      80.940   3874437        357114  0.916    Europe
3      60.665   2167744        301336  0.873    Europe
4     127.061   4602367        377930  0.891      Asia
5      64.511   2950039        242495  0.907    Europe
6     318.523  17348075       9525067  0.915   America

In [45]:
df.index = [
    'Canada',
    'France',
    'Germany',
    'Italy',
    'Japan',
    'United Kingdom',
    'United States',
]

In [46]:
df

                Population       GDP  Surface Area    HDI Continent
Canada              35.467   1785387       9984670  0.913   America
France              63.951   2833687        640679  0.888    Europe
Germany             80.940   3874437        357114  0.916    Europe
Italy               60.665   2167744        301336  0.873    Europe
Japan              127.061   4602367        377930  0.891      Asia
United Kingdom      64.511   2950039        242495  0.907    Europe
United States      318.523  17348075       9525067  0.915   America

In [47]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, Canada to United States
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Population    7 non-null      float64
 1   GDP           7 non-null      int64
 2   Surface Area  7 non-null      int64
 3   HDI           7 non-null      float64
 4   Continent     7 non-null      object
dtypes: float64(2), int64(2), object(1)
memory usage: 336.0+ bytes

In [48]:
df.describe()

       Population           GDP  Surface Area       HDI
count    7.000000  7.000000e+00  7.000000e+00  7.000000
mean   107.302571  5.080248e+06  3.061327e+06  0.900429
std     97.249970  5.494020e+06  4.576187e+06  0.016592
min     35.467000  1.785387e+06  2.424950e+05  0.873000
25%     62.308000  2.500716e+06  3.292250e+05  0.889500
50%     64.511000  2.950039e+06  3.779300e+05  0.907000
75%    104.000500  4.238402e+06  5.082873e+06  0.914000
max    318.523000  1.734808e+07  9.984670e+06  0.916000

In [49]:
df.loc['Canada']

Population       35.467
GDP             1785387
Surface Area    9984670
HDI               0.913
Continent       America
Name: Canada, dtype: object

In [50]:
df

                Population       GDP  Surface Area    HDI Continent
Canada              35.467   1785387       9984670  0.913   America
France              63.951   2833687        640679  0.888    Europe
Germany             80.940   3874437        357114  0.916    Europe
Italy               60.665   2167744        301336  0.873    Europe
Japan              127.061   4602367        377930  0.891      Asia
United Kingdom      64.511   2950039        242495  0.907    Europe
United States      318.523  17348075       9525067  0.915   America

In [51]:
df.iloc[-1]

Population       318.523
GDP             17348075
Surface Area     9525067
HDI                0.915
Continent        America
Name: United States, dtype: object

In [52]:
df['Population']

Canada             35.467
France             63.951
Germany            80.940
Italy              60.665
Japan             127.061
United Kingdom     64.511
United States     318.523
Name: Population, dtype: float64

Note that the index of the returned Series is the same as the DataFrame one. And its name is the name of the column. 
Multiple columns can also be selected similarly to numpy and Series. In this case, the result is another DataFrame.

In [53]:
df[['Population', 'GDP']]

                Population       GDP
Canada              35.467   1785387
France              63.951   2833687
Germany             80.940   3874437
Italy               60.665   2167744
Japan              127.061   4602367
United Kingdom      64.511   2950039
United States      318.523  17348075

Slicing works differently, it acts at "row level", and can be counter intuitive:

In [54]:
df[1:3]

         Population      GDP  Surface Area    HDI Continent
France       63.951  2833687        640679  0.888    Europe
Germany      80.940  3874437        357114  0.916    Europe

Row level selection works better with loc and iloc which are recommended over regular "direct slicing" (df[:]).

loc selects rows matching the given index:

In [55]:
df.loc['Italy']

Population       60.665
GDP             2167744
Surface Area     301336
HDI               0.873
Continent        Europe
Name: Italy, dtype: object

In [56]:
df.loc['France': 'Italy']

         Population      GDP  Surface Area    HDI Continent
France       63.951  2833687        640679  0.888    Europe
Germany      80.940  3874437        357114  0.916    Europe
Italy        60.665  2167744        301336  0.873    Europe

As a second "argument", you can pass the column(s) you'd like to select:

In [57]:
df.loc['France': 'Italy', ['Population', 'GDP']]

         Population      GDP
France       63.951  2833687
Germany      80.940  3874437
Italy        60.665  2167744

In [58]:
df

                Population       GDP  Surface Area    HDI Continent
Canada              35.467   1785387       9984670  0.913   America
France              63.951   2833687        640679  0.888    Europe
Germany             80.940   3874437        357114  0.916    Europe
Italy               60.665   2167744        301336  0.873    Europe
Japan              127.061   4602367        377930  0.891      Asia
United Kingdom      64.511   2950039        242495  0.907    Europe
United States      318.523  17348075       9525067  0.915   America

In [59]:
df.iloc[[0, 1, -1]]

               Population       GDP  Surface Area    HDI Continent
Canada             35.467   1785387       9984670  0.913   America
France             63.951   2833687        640679  0.888    Europe
United States     318.523  17348075       9525067  0.915   America

In [60]:
df.iloc[1:3]

         Population      GDP  Surface Area    HDI Continent
France       63.951  2833687        640679  0.888    Europe
Germany      80.940  3874437        357114  0.916    Europe

In [61]:
df.iloc[1:3, 3]

France     0.888
Germany    0.916
Name: HDI, dtype: float64

In [62]:
df.iloc[1:3, [0, 3]]

         Population    HDI
France       63.951  0.888
Germany      80.940  0.916

In [63]:
df.iloc[1:3, 1:3]

             GDP  Surface Area
France   2833687        640679
Germany  3874437        357114

## Masking: Boolen indexing

In [64]:
df['Population'] > 70

Canada            False
France            False
Germany            True
Italy             False
Japan              True
United Kingdom    False
United States      True
Name: Population, dtype: bool

The boolean matching is done at Index level, so you can filter by any row, as long as it contains the right indexes. Column selection still works as expected:

In [65]:
df.loc[df['Population'] > 70]

               Population       GDP  Surface Area    HDI Continent
Germany            80.940   3874437        357114  0.916    Europe
Japan             127.061   4602367        377930  0.891      Asia
United States     318.523  17348075       9525067  0.915   America

In [66]:
df.loc[df['Population'] > 70, 'Population']

Germany           80.940
Japan            127.061
United States    318.523
Name: Population, dtype: float64

In [67]:
df.loc[df['Population'] > 70, ['Population', 'GDP']]

               Population       GDP
Germany            80.940   3874437
Japan             127.061   4602367
United States     318.523  17348075

### Some descriptive analysis

In [68]:
population = df['Population']
population.min(), population.max()
population.sum()
population.sum() / len(population)
population.mean()
population.median()

64.511

-------------

# 4.  Dropping data from a dataFrame

Opposed to the concept of selection, we have "dropping". Instead of pointing out which values you'd like to select you could point which ones you'd like to drop:

In [69]:
df.drop('Canada', inplace= True)

In [70]:
df

                Population       GDP  Surface Area    HDI Continent
France              63.951   2833687        640679  0.888    Europe
Germany             80.940   3874437        357114  0.916    Europe
Italy               60.665   2167744        301336  0.873    Europe
Japan              127.061   4602367        377930  0.891      Asia
United Kingdom      64.511   2950039        242495  0.907    Europe
United States      318.523  17348075       9525067  0.915   America

In [71]:
df.drop('Japan')

                Population       GDP  Surface Area    HDI Continent
France              63.951   2833687        640679  0.888    Europe
Germany             80.940   3874437        357114  0.916    Europe
Italy               60.665   2167744        301336  0.873    Europe
United Kingdom      64.511   2950039        242495  0.907    Europe
United States      318.523  17348075       9525067  0.915   America

In [72]:
df

                Population       GDP  Surface Area    HDI Continent
France              63.951   2833687        640679  0.888    Europe
Germany             80.940   3874437        357114  0.916    Europe
Italy               60.665   2167744        301336  0.873    Europe
Japan              127.061   4602367        377930  0.891      Asia
United Kingdom      64.511   2950039        242495  0.907    Europe
United States      318.523  17348075       9525067  0.915   America

In [73]:
df.drop(columns=['Population', 'HDI'])

                     GDP  Surface Area Continent
France           2833687        640679    Europe
Germany          3874437        357114    Europe
Italy            2167744        301336    Europe
Japan            4602367        377930      Asia
United Kingdom   2950039        242495    Europe
United States   17348075       9525067   America

In [74]:
df.drop(['Italy', 'Japan'], axis=0)

                Population       GDP  Surface Area    HDI Continent
France              63.951   2833687        640679  0.888    Europe
Germany             80.940   3874437        357114  0.916    Europe
United Kingdom      64.511   2950039        242495  0.907    Europe
United States      318.523  17348075       9525067  0.915   America

In [75]:
df.drop(['Population', 'HDI'], axis=1)

                     GDP  Surface Area Continent
France           2833687        640679    Europe
Germany          3874437        357114    Europe
Italy            2167744        301336    Europe
Japan            4602367        377930      Asia
United Kingdom   2950039        242495    Europe
United States   17348075       9525067   America

All these drop methods return a new DataFrame. If you'd like to modify it "in place", you can use the inplace attribute (there's an example below).

--------------

# 5. Modifying DataFrames
It's simple and intuitive, You can add columns, or replace values for columns without issues:

 ## Adding a new column

In [76]:
langs = pd.Series(
    ['French', 'German', 'Italian'],
    index=['France', 'Germany', 'Italy'],
    name='Language'
)

In [77]:
langs

France      French
Germany     German
Italy      Italian
Name: Language, dtype: object

In [78]:
df['Language'] = langs

In [79]:
df

                Population       GDP  Surface Area    HDI Continent Language
France              63.951   2833687        640679  0.888    Europe   French
Germany             80.940   3874437        357114  0.916    Europe   German
Italy               60.665   2167744        301336  0.873    Europe  Italian
Japan              127.061   4602367        377930  0.891      Asia      NaN
United Kingdom      64.511   2950039        242495  0.907    Europe      NaN
United States      318.523  17348075       9525067  0.915   America      NaN

 ## Replacing values per column

In [80]:
df['Language'] = 'English'
df

                Population       GDP  Surface Area    HDI Continent Language
France              63.951   2833687        640679  0.888    Europe  English
Germany             80.940   3874437        357114  0.916    Europe  English
Italy               60.665   2167744        301336  0.873    Europe  English
Japan              127.061   4602367        377930  0.891      Asia  English
United Kingdom      64.511   2950039        242495  0.907    Europe  English
United States      318.523  17348075       9525067  0.915   America  English

In [81]:
df['GDP Per Capita'] = df['GDP'] / df['Population']
df

,Population,GDP,Surface Area,HDI,Continent,Language,GDP Per Capita
France,63.951,2833687,640679,0.888,Europe,English,44310.284437
Germany,80.940,3874437,357114,0.916,Europe,English,47868.013343
Italy,60.665,2167744,301336,0.873,Europe,English,35733.025633
Japan,127.061,4602367,377930,0.891,Asia,English,36221.712406
United Kingdom,64.511,2950039,242495,0.907,Europe,English,45729.239975
United States,318.523,17348075,9525067,0.915,America,English,54464.120330

## Renaming Columns

In [82]:

df.rename(
    columns={
        'HDI': 'Human Development Index',
        'Anual Popcorn Consumption': 'APC'
    }, index={
        'United States': 'USA',
        'United Kingdom': 'UK',
        'Argentina': 'AR'
    })

,Population,GDP,Surface Area,Human Development Index,Continent,Language,GDP Per Capita
France,63.951,2833687,640679,0.888,Europe,English,44310.284437
Germany,80.940,3874437,357114,0.916,Europe,English,47868.013343
Italy,60.665,2167744,301336,0.873,Europe,English,35733.025633
Japan,127.061,4602367,377930,0.891,Asia,English,36221.712406
UK,64.511,2950039,242495,0.907,Europe,English,45729.239975
USA,318.523,17348075,9525067,0.915,America,English,54464.120330

In [83]:
df.rename(index=str.upper)

,Population,GDP,Surface Area,HDI,Continent,Language,GDP Per Capita
FRANCE,63.951,2833687,640679,0.888,Europe,English,44310.284437
GERMANY,80.940,3874437,357114,0.916,Europe,English,47868.013343
ITALY,60.665,2167744,301336,0.873,Europe,English,35733.025633
JAPAN,127.061,4602367,377930,0.891,Asia,English,36221.712406
UNITED KINGDOM,64.511,2950039,242495,0.907,Europe,English,45729.239975
UNITED STATES,318.523,17348075,9525067,0.915,America,English,54464.120330

In [84]:
df.rename(index=lambda x: x.lower())

,Population,GDP,Surface Area,HDI,Continent,Language,GDP Per Capita
france,63.951,2833687,640679,0.888,Europe,English,44310.284437
germany,80.940,3874437,357114,0.916,Europe,English,47868.013343
italy,60.665,2167744,301336,0.873,Europe,English,35733.025633
japan,127.061,4602367,377930,0.891,Asia,English,36221.712406
united kingdom,64.511,2950039,242495,0.907,Europe,English,45729.239975
united states,318.523,17348075,9525067,0.915,America,English,54464.120330

You can directly set the new index and values to the DataFrame:

In [85]:
df.loc['China'] = pd.Series({'Population': 1_400_000_000, 'Continent': 'Asia'})

In [86]:
df

,Population,GDP,Surface Area,HDI,Continent,Language,GDP Per Capita
France,6.395100e+01,2833687.0,640679.0,0.888,Europe,English,44310.284437
Germany,8.094000e+01,3874437.0,357114.0,0.916,Europe,English,47868.013343
Italy,6.066500e+01,2167744.0,301336.0,0.873,Europe,English,35733.025633
Japan,1.270610e+02,4602367.0,377930.0,0.891,Asia,English,36221.712406
United Kingdom,6.451100e+01,2950039.0,242495.0,0.907,Europe,English,45729.239975
United States,3.185230e+02,17348075.0,9525067.0,0.915,America,English,54464.120330
China,1.400000e+09,NaN,NaN,NaN,Asia,NaN,NaN

In [87]:
df.reset_index()
df.set_index('Population')

,GDP,Surface Area,HDI,Continent,Language,GDP Per Capita
Population,,,,,,
6.395100e+01,2833687.0,640679.0,0.888,Europe,English,44310.284437
8.094000e+01,3874437.0,357114.0,0.916,Europe,English,47868.013343
6.066500e+01,2167744.0,301336.0,0.873,Europe,English,35733.025633
1.270610e+02,4602367.0,377930.0,0.891,Asia,English,36221.712406
6.451100e+01,2950039.0,242495.0,0.907,Europe,English,45729.239975
3.185230e+02,17348075.0,9525067.0,0.915,America,English,54464.120330
1.400000e+09,NaN,NaN,NaN,Asia,NaN,NaN

### Sorting rows using column values

The rows can also be sorted by a specific column using `.sort_values`. Let's sort to identify the days with the highest number of cases, then chain it with the `head` method to list just the first ten results.

In [88]:
df.sort_values('Population', ascending=False).head(10)

,Population,GDP,Surface Area,HDI,Continent,Language,GDP Per Capita
China,1.400000e+09,NaN,NaN,NaN,Asia,NaN,NaN
United States,3.185230e+02,17348075.0,9525067.0,0.915,America,English,54464.120330
Japan,1.270610e+02,4602367.0,377930.0,0.891,Asia,English,36221.712406
Germany,8.094000e+01,3874437.0,357114.0,0.916,Europe,English,47868.013343
United Kingdom,6.451100e+01,2950039.0,242495.0,0.907,Europe,English,45729.239975
France,6.395100e+01,2833687.0,640679.0,0.888,Europe,English,44310.284437
Italy,6.066500e+01,2167744.0,301336.0,0.873,Europe,English,35733.025633

# 6. Grouping and aggregating data

Pandas supports grouping data frames for particular columns similar to a SQL group by clause.

In [89]:
help(df.groupby)

Help on method groupby in module pandas.core.frame:

groupby(by=None, axis: 'Axis | lib.NoDefault' = <no_default>, level: 'IndexLabel | None' = None, as_index: 'bool' = True, sort: 'bool' = True, group_keys: 'bool' = True, observed: 'bool | lib.NoDefault' = <no_default>, dropna: 'bool' = True) -> 'DataFrameGroupBy' method of pandas.core.frame.DataFrame instance
    Group DataFrame using a mapper or by a Series of columns.

    A groupby operation involves some combination of splitting the
    object, applying a function, and combining the results. This can be
    used to group large amounts of data and compute operations on these
    groups.

    Parameters
    ----------
    by : mapping, function, label, pd.Grouper or list of such
        Used to determine the groups for the groupby.
        If ``by`` is a function, it's called on each value of the object's
        index. If a dict or Series is passed, the Series or dict VALUES
        will be used to determine the groups (the Series' values are first
        aligned; see ``.align()`` method). If a list or ndarray of length
        equal to the selected axis is passed (see the `groupby user guide
        <https://pandas.pydata.org/pandas-docs/stable/user_guide/groupby.html#splitting-an-object-into-groups>`_),
        the values are used as-is to determine the groups. A label or list
        of labels may be passed to group by the columns in ``self``.
        Notice that a tuple is interpreted as a (single) key.
    axis : {0 or 'index', 1 or 'columns'}, default 0
        Split along rows (0) or columns (1). For `Series` this parameter
        is unused and defaults to 0.

        .. deprecated:: 2.1.0

            Will be removed and behave like axis=0 in a future version.
            For ``axis=1``, do ``frame.T.groupby(...)`` instead.

    level : int, level name, or sequence of such, default None
        If the axis is a MultiIndex (hierarchical), group by a particular
        level or levels. Do not specify both ``by`` and ``level``.
    as_index : bool, default True
        Return object with group labels as the
        index. Only relevant for DataFrame input. as_index=False is
        effectively "SQL-style" grouped output. This argument has no effect
        on filtrations (see the `filtrations in the user guide
        <https://pandas.pydata.org/docs/dev/user_guide/groupby.html#filtration>`_),
        such as ``head()``, ``tail()``, ``nth()`` and in transformations
        (see the `transformations in the user guide
        <https://pandas.pydata.org/docs/dev/user_guide/groupby.html#transformation>`_).
    sort : bool, default True
        Sort group keys. Get better performance by turning this off.
        Note this does not influence the order of observations within each
        group. Groupby preserves the order of rows within each group. If False,
        the groups will appear in the same order as they did in the original DataFrame.
        This argument has no effect on filtrations (see the `filtrations in the user guide
        <https://pandas.pydata.org/docs/dev/user_guide/groupby.html#filtration>`_),
        such as ``head()``, ``tail()``, ``nth()`` and in transformations
        (see the `transformations in the user guide
        <https://pandas.pydata.org/docs/dev/user_guide/groupby.html#transformation>`_).

        .. versionchanged:: 2.0.0

            Specifying ``sort=False`` with an ordered categorical grouper will no
            longer sort the values.

    group_keys : bool, default True
        When calling apply and the ``by`` argument produces a like-indexed
        (i.e. :ref:`a transform <groupby.transform>`) result, add group keys to
        index to identify pieces. By default group keys are not included
        when the result's index (and column) labels match the inputs, and
        are included otherwise.

        .. versionchanged:: 1.5.0

           Warns that ``group_keys`` will no longer be ignored when the
           result from ``apply`` is a like-indexed Series or DataFrame.
           Specify ``group_keys`` explicitly to include the group keys or
           not.

        .. versionchanged:: 2.0.0

           ``group_keys`` now defaults to ``True``.

    observed : bool, default False
        This only applies if any of the groupers are Categoricals.
        If True: only show observed values for categorical groupers.
        If False: show all values for categorical groupers.

        .. deprecated:: 2.1.0

            The default value will change to True in a future version of pandas.

    dropna : bool, default True
        If True, and if group keys contain NA values, NA values together
        with row/column will be dropped.
        If False, NA values will also be treated as the key in groups.

    Returns
    -------
    pandas.api.typing.DataFrameGroupBy
        Returns a groupby object that contains information about the groups.

    See Also
    --------
    resample : Convenience method for frequency conversion and resampling
        of time series.

    Notes
    -----
    See the `user guide
    <https://pandas.pydata.org/pandas-docs/stable/groupby.html>`__ for more
    detailed usage and examples, including splitting an object into groups,
    iterating through groups, selecting a group, aggregation, and more.

    Examples
    --------
    >>> df = pd.DataFrame({'Animal': ['Falcon', 'Falcon',
    ...                               'Parrot', 'Parrot'],
    ...                    'Max Speed': [380., 370., 24., 26.]})
    >>> df
       Animal  Max Speed
    0  Falcon      380.0
    1  Falcon      370.0
    2  Parrot       24.0
    3  Parrot       26.0
    >>> df.groupby(['Animal']).mean()
            Max Speed
    Animal
    Falcon      375.0
    Parrot       25.0

    **Hierarchical Indexes**

    We can groupby different levels of a hierarchical index
    using the `level` parameter:

    >>> arrays = [['Falcon', 'Falcon', 'Parrot', 'Parrot'],
    ...           ['Captive', 'Wild', 'Captive', 'Wild']]
    >>> index = pd.MultiIndex.from_arrays(arrays, names=('Animal', 'Type'))
    >>> df = pd.DataFrame({'Max Speed': [390., 350., 30., 20.]},
    ...                   index=index)
    >>> df
                    Max Speed
    Animal Type
    Falcon Captive      390.0
           Wild         350.0
    Parrot Captive       30.0
           Wild          20.0
    >>> df.groupby(level=0).mean()
            Max Speed
    Animal
    Falcon      370.0
    Parrot       25.0
    >>> df.groupby(level="Type").mean()
             Max Speed
    Type
    Captive      210.0
    Wild         185.0

    We can also choose to include NA in group keys or not by setting
    `dropna` parameter, the default setting is `True`.

    >>> l = [[1, 2, 3], [1, None, 4], [2, 1, 3], [1, 2, 2]]
    >>> df = pd.DataFrame(l, columns=["a", "b", "c"])

    >>> df.groupby(by=["b"]).sum()
        a   c
    b
    1.0 2   3
    2.0 2   5

    >>> df.groupby(by=["b"], dropna=False).sum()
        a   c
    b
    1.0 2   3
    2.0 2   5
    NaN 1   4

    >>> l = [["a", 12, 12], [None, 12.3, 33.], ["b", 12.3, 123], ["a", 1, 1]]
    >>> df = pd.DataFrame(l, columns=["a", "b", "c"])

    >>> df.groupby(by="a").sum()
        b     c
    a
    a   13.0   13.0
    b   12.3  123.0

    >>> df.groupby(by="a", dropna=False).sum()
        b     c
    a
    a   13.0   13.0
    b   12.3  123.0
    NaN 12.3   33.0

    When using ``.apply()``, use ``group_keys`` to include or exclude the
    group keys. The ``group_keys`` argument defaults to ``True`` (include).

    >>> df = pd.DataFrame({'Animal': ['Falcon', 'Falcon',
    ...                               'Parrot', 'Parrot'],
    ...                    'Max Speed': [380., 370., 24., 26.]})
    >>> df.groupby("Animal", group_keys=True).apply(lambda x: x)
              Animal  Max Speed
    Animal
    Falcon 0  Falcon      380.0
           1  Falcon      370.0
    Parrot 2  Parrot       24.0
           3  Parrot       26.0

    >>> df.groupby("Animal", group_keys=False).apply(lambda x: x)
       Animal  Max Speed
    0  Falcon      380.0
    1  Falcon      370.0
    2  Parrot       24.0
    3  Parrot       26.0

In [90]:
df2 = pd.DataFrame({'a' : ['one','one','two','three','two','one','six'],
                 'b' : ['x','y','y','x','y','x','x'],
                 'c' : np.random.randn(7)})
df2

       a  b         c
0    one  x  0.898105
1    one  y  1.348412
2    two  y -0.955630
3  three  x  1.892216
4    two  y -0.357853
5    one  x -0.786912
6    six  x -0.875025

In [91]:
df2.groupby('a') #creates a groupby object

The result is a new data frame that uses unique values from the column passed to groupby as the index. Grouping and aggregation is a powerful method for progressively summarizing data into smaller data frames.

Instead of aggregating by sum, you can also aggregate by other measures like mean.

In [92]:
#works on multiple levels
df2.groupby(['a','b']).mean()

                c
a     b
one   x  0.055597
      y  1.348412
six   x -0.875025
three x  1.892216
two   y -0.656741

# 6. Dealing with missing values:

In [93]:
wh = pd.read_csv("kumpula-weather-2017.csv")
wh.describe()

,Year,m,d,Precipitation amount (mm),Snow depth (cm),Air temperature (degC)
count,365.0,365.000000,365.000000,365.000000,358.000000,365.000000
mean,2017.0,6.526027,15.720548,1.966301,0.966480,6.527123
std,0.0,3.452584,8.808321,4.858423,3.717472,7.183934
min,2017.0,1.000000,1.000000,-1.000000,-1.000000,-17.800000
25%,2017.0,4.000000,8.000000,-1.000000,-1.000000,1.200000
50%,2017.0,7.000000,16.000000,0.200000,-1.000000,4.800000
75%,2017.0,10.000000,23.000000,2.700000,0.000000,12.900000
max,2017.0,12.000000,31.000000,35.000000,15.000000,19.600000

You may have noticed something strange in the output of the describe method. First, the minimum value in both precipitation and snow depth fields is -1. The special value -1 means that on that day there was absolutely no snow or rain, whereas the value 0 might indicate that the value was close to zero. Secondly, the snow depth column has count 358, whereas the other columns have count 365, one measurement/value for each day of the year. How is this possible? Every field in a DataFrame should have the same number of rows. Let’s use the unique method of the Series object to find out, which different values are used in this column:

In [94]:
wh["Snow depth (cm)"].unique()

array([-1.,  7., 13., 10., 12.,  9.,  8.,  5.,  6.,  4.,  3., 15., 14.,
        2., nan,  0.])

In [95]:
wh["Snow depth (cm)"].value_counts()

Snow depth (cm)
-1.0     263
 8.0      17
 6.0      14
 5.0      13
 7.0      10
 0.0       8
 4.0       6
 13.0      5
 10.0      5
 3.0       5
 2.0       4
 12.0      3
 9.0       3
 15.0      1
 14.0      1
Name: count, dtype: int64

The float type allows a special value nan (Not A Number), in addition to normal floating point numbers. This value can represent the result from an illegal operation. For example, the operation 0/0 can either cause an exception to occur or just silently produce a nan. In Pandas nan can be used to represent a missing value. In the weather DataFrame the nan value tells us that the measurement from that day is not available, possibly due to a broken measuring instrument or some other problem.

The missing values can be located with the isnull method:

In [96]:
wh.isnull()      # returns a boolean mask DataFrame

,Year,m,d,Time,Time zone,Precipitation amount (mm),Snow depth (cm),Air temperature (degC)
0,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...
360,False,False,False,False,False,False,False,False
361,False,False,False,False,False,False,False,False
362,False,False,False,False,False,False,False,False
363,False,False,False,False,False,False,False,False
364,False,False,False,False,False,False,False,False

This is not very useful as we cannot directly use the mask to index the DataFrame. We can, however, combine it with the any method to find out all the rows that contain at least one missing value:

In [97]:
wh[wh.isnull().any(axis=1)]

,Year,m,d,Time,Time zone,Precipitation amount (mm),Snow depth (cm),Air temperature (degC)
74,2017,3,16,00:00,UTC,1.8,NaN,3.4
163,2017,6,13,00:00,UTC,0.6,NaN,12.6
308,2017,11,5,00:00,UTC,0.2,NaN,8.4
309,2017,11,6,00:00,UTC,2.0,NaN,7.5
313,2017,11,10,00:00,UTC,3.6,NaN,7.2
321,2017,11,18,00:00,UTC,11.3,NaN,5.9
328,2017,11,25,00:00,UTC,8.5,NaN,4.2

The notnull method works conversively to the isnull method.

The dropna method of a DataFrame drops columns or rows that contain missing values from the DataFrame, depending on the axis parameter.

In [98]:
wh.dropna().shape   # Default axis is 0

(358, 8)

In [99]:
wh.dropna(axis=1).shape # Drops the columns containing missing values

(365, 7)

The fillna method allows to fill the missing values with some constant or interpolated values. The method parameter can be:

- None: use the given positional parameter as the constant to fill missing values with
- ffill: use the previous value to fill the current value
- bfill: use the next value to fill the current value
- Replace it with 0.
- Replace it with the average of the entire column
- Replace it with the average of the values on the previous & next date
- Discard the row entirely

The choice of the method depends on the nature of missing data. 

For example, for the weather data we could use forward fill

In [100]:
wh.fillna(method='ffill', inplace=True)
wh[wh.isnull().any(axis=1)]

/var/folders/sg/td2g432d4_q96v_4dnz198hc0000gq/T/ipykernel_12503/2901266304.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  wh.fillna(method='ffill', inplace=True)

Empty DataFrame
Columns: [Year, m, d, Time, Time zone, Precipitation amount (mm), Snow depth (cm), Air temperature (degC)]
Index: []

## Save DataFrame to a file: 
To write the data from the data frame into a file, we can use the `to_csv` function. The to_csv function also includes an additional column for storing the index of the dataframe by default. We pass index=None to turn off this behavior.

In [101]:
wh.to_csv('wheather_modified.csv', index=None)

----------------

# References: 
- Pandas Documentation https://pandas.pydata.org/pandas-docs/stable/pandas.pdf
- https://nbviewer.jupyter.org/github/mgrani/LODA-lecture-notes-on-data-analysis/blob/master/I.Data-Science-in-Python/DSiP-6-Pandas.ipynb
- https://github.com/ine-rmotr-curriculum/freecodecamp-intro-to-pandas/blob/master/3%20-%20Pandas%20-%20DataFrames.ipynb
- https://saskeli.github.io/data-analysis-with-python-summer-2019/pandas2.html